{"content":"<p>Several weeks ago I wrote about <a href=\"/2016/03/21/socket-to-me\">getting up and running with Socket.IO</a>. I&#39;ve used Socket.IO a bunch since, and have found one of the most useful features to be the ease with which you can join and leave rooms. To the extent that you can, your filtering of data and socket management should be occurring on the server, not on the client &mdash; <code>join</code> and <code>leave</code> let you easily sort out which sockets get what data emitted to them. </p>\n<p>I am currently working on a project where we have a continuous, hot stream of data coming into our server from a variety of sources. When a new piece of data comes in to the server, we want to be able to process it, then push it out to connected clients in a slightly altered form. However, we want connected clients to be able to pick and choose which source they are receiving data from. I&#39;m not sure that this is an ideal use case for Socket.IO. However, we already had a socket server in place for other purposes, so it seemed worthwhile to give it a shot.</p>\n<p>This problem can be broken down into three main parts, with Socket.IO serving as the linchpin:</p>\n<ol>\n<li><p>We need a way for Socket.IO to listen for the data coming into the server and getting processed. We want to send the processed data out over the socket connections. We ended up using the Node.js <code>EventEmitter</code> for this purpose.</p>\n</li>\n<li><p>We need the incoming data to have some identifiable property that splits it into rooms/channels/sources. One <code>EventEmitter</code> instance is going to be passing in the aggregated data to the socket server from all sources, and we need an identifier on each incoming object in order to know where to send it. Socket rooms are identified by strings.</p>\n</li>\n<li><p>We need the connected clients to be able to join and leave socket rooms at will from the browser. Ideally we have all of the room names available to us on the client-side so we can easily identify a given room on the server.</p>\n</li>\n</ol>\n<p>Let&#39;s start with the first problem. The source of the data is irrelevant, so let&#39;s assume that we have an SDK that abstracts away any complexity with receiving the data. What we want is to be able to listen for incoming data:</p>\n<pre><code>// let&#39;s first get an instance of the EventEmitter\nconst events = require(&#39;events&#39;);\nconst eventEmitter = new events.EventEmitter();\n\n// once we have connected an instance of our imaginary\n// sdk, let&#39;s assume that we have an event listener\n// available to us that can listen for events of type\n// &#39;dataReceived&#39;\nmyDataConnection.on(&#39;dataReceived&#39;, (dataObj) =&gt; {\n  // now that we are listening for incoming data, \n  // let&#39;s respond by emitting out that data. the\n  // event naming here is arbitrary...\n  eventEmitter.emit(&#39;newData&#39;, dataObj);\n});</code></pre>\n<p>Now we have a <code>newData</code> event emitting out data when it comes in. All we need to do is have our socket server listen for this event, then pass the data onto the connected clients.</p>\n<pre><code>io.on(&#39;connection&#39;, (socket) =&gt; {\n\n  // we listen for a &#39;newData&#39; event from the eventEmitter\n  eventEmitter.on(&#39;newData&#39;, (data) =&gt; {\n    // when that event fires, we send the associated data\n    // out to all of our connected clients\n    io.emit(&#39;data:update&#39;, data);\n  });\n\n});</code></pre>\n<p>This brings us to the problem of filtering out the incoming data so that only some portion of the stream is going out to a given client. Let&#39;s assume that the <code>dataObj</code> coming in on <code>myDataConnection</code> has a property that we can use for this room assignment, something like <code>.name</code> or <code>.channel</code>. We can update our socket server so that we only emit incoming data out to sockets subscribed to the room that shares this name:</p>\n<pre><code>io.on(&#39;connection&#39;, (socket) =&gt; {\n\n  eventEmitter.on(&#39;newData&#39;, (data) =&gt; {\n    // the data passed in is an object with a property \n    // .name that we will use as a room name\n    const roomName = data.name;\n\n    // we now will only emit data to the room that shares \n    // this name, using .to\n    io.to(roomName).emit(&#39;data:update&#39;, data);\n  });\n\n});</code></pre>\n<p>We still need a way for a client to subscribe to a given room. Likewise, a client should be able to easily unsubscribe. Let&#39;s add some listeners to the socket server to handle this.</p>\n<pre><code>io.on(&#39;connection&#39;, (socket) =&gt; {\n\n  // listen for a room:subscribe event\n  socket.on(&#39;room:subscribe&#39;, (roomName) =&gt; {\n    // when a room:subscribe event comes in, the socket that\n    // emitted the event joins the room that was passed\n    socket.join(roomName);\n  });\n\n  // listen for a room:unsubscribe event\n  socket.on(&#39;room:unsubscribe&#39;, (roomName) =&gt; {\n    // when a room:unsubscribe event comes in, the socket that\n    // emitted the event leaves the room that was passed\n    socket.leave(roomName);\n  });\n\n  eventEmitter.on(&#39;newData&#39;, (data) =&gt; {\n    const roomName = data.name;\n    io.to(roomName).emit(&#39;data:update&#39;, data);\n  });\n\n});</code></pre>\n<p>The implementation on the client is highly dependent on what framework we are using, if any. As a basic example, we could do something like the following (after including <code>&lt;script src=&quot;/socket.io/socket.io.js&quot;&gt;&lt;/script&gt;</code> in your html file):</p>\n<pre><code>const socket = io();\n\n// the below can be used as updateSubscription(roomName) on,\n// for instance, a click handler\nconst updateSubscription = (() =&gt; {\n  let currentRoom = null;\n\n  return (roomName) =&gt; {\n    if (currentRoom) {\n      // if there is a room already set, unsubcribe from it\n      socket.emit(&#39;room:unsubscribe&#39;, currentRoom);\n    }\n    // subscribe to roomName, set currentRoom\n    socket.emit(&#39;room:subscribe&#39;, roomName);\n    currentRoom = roomName;\n  }\n})();\n\n// the final step is to listen for data coming into the\n// room that we&#39;ve subscribed to.\nsocket.on(&#39;data:update&#39;, (data) =&gt; {\n  // do something with the incoming data!\n});</code></pre>","meta":{"year":"2016","month":"05","day":"04","filename":"socket-io-join-and-leave","title":"Socket.IO Join and Leave","date":"2016-05-04T12:00:00.000Z","desc":"Handling subscribing and unsubscribing with Socket.IO","tags":["Socket.IO","join","leave","JavaScript"]}}