{"content":"<p>We previously started looking at <a href=\"/2016/05/10/react-svg-graphs\">making an SVG line graph with a data set</a>, specifically with reference to rendering streaming data in React. So far what we have is an SVG path that we&#39;ve assembled from one set of data. Our decibel-level data was <code>[4.5, 52, 37, 91]</code>. The resulting SVG path looks like this, with time plotted on the x-axis and decibels plotted on the y:</p>\n<svg width=\"150\" height=\"100\" viewBox=\"0 0 150 100\">\n  <path stroke=\"#FF0000\" stroke-width=\"2\" fill=\"none\"\n    d=\"M 0 95.5 L 50 48 L 100 63 L 150 9\"\n  />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 100 L 150 100\" />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 0 L 0 100\" />\n</svg>\n\n<p>This path looks fine, but it is very clearly coming from discrete readings. If those data points are actually averages of data over the course of that time interval, then it may be more representative to show the data as a continuous curve. Regardless of whether or not it is more accurate, a curve is probably nicer to look at than a jagged line anyway!</p>\n<p>We can use the <code>Curveto</code> command when building up our path from a set of data points to give the appearance of interpolation. Specifically, we want to use <code>C</code>, the cubic bezier curve command. Keep in mind that because we are using uppercase <code>C</code> and not lowercase <code>c</code>, all coordinates will be in absolute rather than relative units.</p>\n<p>The syntax for using <code>C</code> when writing a path is:</p>\n<pre><code>C &lt;control point 1&gt; &lt;control point 2&gt; &lt;end point&gt;</code></pre>\n<p>We already know the end point (this will be the same coordinate that we moved to in our previous, jagged path). The control points may take a bit of tinkering to figure out what works for your data. The important thing to note is that the y coordinates of the control points will be proportional to the last point in the path and the next end point (the one that is part of the <code>C</code> syntax). It took me a little bit of tinkering to find something that worked well for my data. What I ended up doing is very simple &mdash; the x-coordinate for both control points is the mid-point between the point being drawn from and the end point; the y-coordinate for the first control point is equal to the y-coordinate for the point being drawn from, and the y-coord for the second control point is equal to the y-coordinate for the end point. So say we are drawing a section of our path from a data point at <code>(50, 16)</code> to the next data point at <code>(100, 47)</code>. Our <code>C</code> from point one to point two would look like this:</p>\n<pre><code>C 75 16 75 47 100 47</code></pre>\n<p>Again, <code>75</code> is the midpoint between our starting x (<code>50</code>) and our ending x (<code>100</code>). <code>16</code> is equal to our starting y, and <code>47</code> is equal to our ending y. <code>100 47</code> is our end point.</p>\n<p>Let&#39;s write out the path from last time, but use <code>C</code> instead of <code>L</code> to draw from data point to data point. We ended up with <code>d=&quot;M 0 95.5 L 50 48 L 100 63 L 150 9&quot;</code> last time for the following data: <code>[4.5, 52, 37, 91]</code>. Again, we need to do the small transform on the data of subtracting from 100 because we draw from the top down on our svg.</p>\n<p>The path starts out the same. Our first point is just a starting point for the rest of the path, so we use the <code>M</code> command to move the path there:</p>\n<pre><code>d=&quot;M 0 95.5&quot;</code></pre>\n<p>Our next point is (50, 48). Recall that our time interval (the x-axis) is a constant set to 50. We use the <code>C</code> command to draw the section to this next point:</p>\n<pre><code>d=&quot;M 0 95.5 C 25 95.5 25 48 50 48&quot;</code></pre>\n<p>Again, control point 1 (<code>25 95.5</code>) has an x-coord that is the midpoint between the point being drawn from and the point being drawn to and a y-coord that is equal to the y-coord of the point being drawn from. Control point 2 (<code>25 48</code>) has the same midpoint x-coordinate and a y-coord that is equal to the y-coord of the point being drawn to. And of course the end point (<code>50 48</code>) is the point that we are drawing to.</p>\n<p>When we finish off this path with the remaining data, we get the following:</p>\n<pre><code>d=&quot;M 0 95.5 C 25 95.5 25 48 50 48 C 75 48 75 63 100 63 C 125 63 125 9 150 9&quot;</code></pre>\n<p>The resulting SVG looks like this:</p>\n<svg width=\"150\" height=\"100\" viewBox=\"0 0 150 100\">\n  <path stroke=\"#FF0000\" stroke-width=\"2\" fill=\"none\"\n    d=\"M 0 95.5 C 25 95.5 25 48 50 48 C 75 48 75 63 100 63 C 125 63 125 9 150 9\"\n  />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 100 L 150 100\" />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 0 L 0 100\" />\n</svg>\n\n<p>Which is at least slightly more appealing than where we started:</p>\n<svg width=\"150\" height=\"100\" viewBox=\"0 0 150 100\">\n  <path stroke=\"#FF0000\" stroke-width=\"2\" fill=\"none\"\n    d=\"M 0 95.5 L 50 48 L 100 63 L 150 9\"\n  />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 100 L 150 100\" />\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 0 0 L 0 100\" />\n</svg>\n\n<p>To build this path in React from our starting array, we can adapt what we have from last time.</p>\n<pre><code>// we have our starting data, which we map\n// over to transform to the coordinate space\n// of the svg we will be drawing on\nvar data = [4.5, 52, 37, 91].map(point =&gt; 100 - point);\n// data now ==&gt; [95.5, 48, 63, 9]\n\n\nvar path = data.reduce((result, point, i, coll) =&gt; {\n  if (i === 0) {\n    result.path += `${result.x} ${point}`;\n  } else {\n    result.path += `C ${result.x - 25} ${coll[i - 1]} ${result.x - 25} ${point} ${result.x} ${point}`;\n  }\n  result.x += 50;\n  return result;\n}, { path: &#39;M&#39;, x: 0 });</code></pre>\n<p>In the final part of this series, we&#39;ll look at how to make this graph dynamic &mdash; how to build the paths on the fly and how to animate the lines across the svg as additional data comes in!</p>","meta":{"year":"2016","month":"05","day":"14","filename":"svg-data-interpolation","title":"SVG Data Interpolation","date":"2016-05-14T12:00:00.000Z","desc":"Making a line of data appear continuous","tags":["SVG","data"]}}