{"content":"<p>In the <a href=\"/2016/03/30/es6-generators\">last post</a>, we looked at the basics of how ES6 generators work. To sum up, generators give us a way to jump in and out of a single function, executing some portion of it each time we enter. The lazy evaluation capabilities of generators make them excellent candidates for executing asynchronous code. How might we go about setting this up? Recall that to iterate through a generator, we need to call <code>.next</code> on the iterator object returned when the generator is executed. If we make the <code>.next</code> calls from within the async functions and pass in the values that we want to return, we can asynchronously cycle through a generator.</p>\n<pre><code>// let&#39;s start with some async functions\n// in each of these, we are passing a return value to a \n// .next call on an iterator object (defined below)\nfunction add10(x) {\n  setTimeout(function() {\n    myIterator.next(x + 10);\n  }, 1000);\n}\n\nfunction multiply3(x) {\n  setTimeout(function() {\n    myIterator.next(x * 3);\n  }, 1000);\n}\n\nfunction divideBy5(x) {\n  setTimeout(function() {\n    myIterator.next(x / 5);\n  }, 1000);\n}\n\n// the generator function\nfunction *myGenerator(x) {\n  var a = yield add10(x);\n  var b = yield multiply3(a);\n  var c = yield divideBy5(b);\n  console.log(c);\n}\n\n// when we call myGenerator, it returns an iterator\n// object. this is what we are calling .next on in the \n// three async functions declared above.\nvar myIterator = myGenerator(10);\n\n// now we can call .next on myIterator to the first line\n// of the generator function to execute. when the yield\n// statement is encountered, we pop out of myGenerator\n// and start executing the async code in add10. when the\n// .next is encountered in add10, we jump back into \n// myGenerator and start evaluating where we left off.\nmyIterator.next();\n\n// after 3 seconds, 12 gets logged to the console</code></pre>\n<p>This example works fine and is really cool, but I think it is more illustrative than it is useful. The async functions can&#39;t get reused as written, as they are referencing a particular iterator object (<code>myIterator</code>). We can&#39;t pass in a reference to the iterator object when we create the generator function, because getting the iterator object in the first place is dependent on invoking the generator. How can this situation be improved upon? Using promises, of course!</p>\n<p>What we want is for our generator function to yield out promise objects. This by itself won&#39;t remedy the situation of having to manually call <code>.next</code> on the iterator object. However, we can pass the generator function to another function that will handle the returned promises for us. There is a great <a href=\"https://www.promisejs.org/generators/\">explanation of this technique</a> by Forbes Lindesay on the PromiseJS website, along with the code for just such a function for handling promises returned by a generator. Various libraries have their own implementations. We can do this using the <a href=\"http://documentup.com/kriskowal/q/\">Q module&#39;s</a> <code>q.spawn()</code>. </p>\n<pre><code>// require in the q module after npm installing it\nvar q = require(&#39;q&#39;);\n\n// we start out with our promise functions\nfunction add10(x) {\n  return new Promise(function(resolve, reject) {\n    setTimeout(function() {\n      if (typeof x !== &#39;number&#39;) {\n        reject(NaN);\n      } else {\n        resolve(x + 10);\n      }\n    }, 1000);\n  });\n}\n\nfunction multiply3(x) {\n  return new Promise(function(resolve, reject) {\n    setTimeout(function() {\n      if (typeof x !== &#39;number&#39;) {\n        reject(NaN);\n      } else {\n        resolve(x * 3);\n      }\n    }, 1000);\n  });\n}\n\nfunction divideBy5(x) {\n  return new Promise(function(resolve, reject) {\n    setTimeout(function() {\n      if (typeof x !== &#39;number&#39;) {\n        reject(NaN);\n      } else {\n        resolve(x / 5);\n      }\n    }, 1000);\n  });\n}\n\n// with q.spawn, we pass in a generator function.\n// it immediately gets invoked, and the promises that\n// are yielded get handled internally by the spawn method\nq.spawn(function* () {\n  var val1 = yield add10(10);\n  var val2 = yield multiply3(val1);\n  var val3 = yield divideBy5(val2);\n  console.log(val3);\n});\n// after 3 seconds, 12 gets logged to the console</code></pre>\n<p>What if we wanted to pass some arguments to the generator function we are passing into <code>q.spawn</code>? The <a href=\"https://www.promisejs.org/generators/\">example code at PromiseJS</a> provides a nice way to pass in additional arguments to get called when the generator function gets executed. <code>q.spawn</code> doesn&#39;t have this option directly, but we can easily update how we pass in the generator function to accomodate this need.</p>\n<pre><code>function makeGenerator(x) {\n  return function *myGenerator() {\n    var val1 = yield add10(x);\n    var val2 = yield multiply3(val1);\n    var val3 = yield divideBy5(val2);\n    console.log(val3);\n  };\n}\n\nq.spawn(makeGenerator(10));\n// 12 gets logged to the console after 3 seconds</code></pre>","meta":{"year":"2016","month":"04","day":"01","filename":"generators-with-promises","title":"Generators with Promises","date":"2016-04-02T12:00:00.000Z","desc":"What happens when generators join forces with promises? Only good things.","tags":["JavaScript","Generators","Promises","q.spawn","ES6"]}}