{"content":"<p>We&#39;ve already covered <a href=\"/2016/05/10/react-svg-graphs\">how to generate an SVG path from a set of data</a> and <a href=\"/2016/05/14/svg-data-interpolation\">how to do some basic path interpolation between data points</a>. So we can now construct curved paths from a data set and render them to an SVG. That is great for rendering out one set of data onto a line graph. But what if this data is continually updating? Is there a way to animate incoming data onto the graph so that the data stream appears continuous, rather than having the paths jump each time the data updates?</p>\n<p>The technique I&#39;m about to outline is reliant on having new data coming in at a known, fixed interval. The reason for this will become clear as we move through an example. We will use GreenSock&#39;s <code>TweenMax</code> for the line animation.</p>\n<p>We should first consider what it is exactly that we will be animating. We want the line paths to move across the graph. We don&#39;t need to animate the drawing of the paths. Instead we can do a little fakery by translating the lines, giving the <em>appearance</em> of the lines being drawn on the graph. This requires us to always have the newest data just off the graph &mdash; animating that data point onto the graph will drive the entire line forward.</p>\n<p>Let&#39;s go back to the data set from last time: <code>[4.5, 52, 37, 91]</code>. We can establish now that we are getting a new data point every 10 seconds, so this array represents 40 seconds worth of data. Now, we need to establish a direction for the data before we move on. I&#39;m going to say that new data points are added to the end of the array; so, 91 is the last data point that we received. On our graph&#39;s x-axis, let&#39;s say that at <code>x = 0</code>, we have the current time, and as we move right on the graph we are going back in time.</p>\n<svg width=\"400\" height=\"50\" viewBox=\"28 48 200 25\">\n  <path stroke=\"#000\" stroke-width=\"1\" fill=\"none\" d=\"M 30 54 L 30 50 L 80 50 L 80 54 L 80 50 L 130 50 L 130 54 L 130 50 L 180 50 L 180 54\" />\n  <text x=\"28\" y=\"64\" font-size=\"8\">NOW</text>\n  <text x=\"78\" y=\"64\" font-size=\"8\">10 sec ago</text>\n  <text x=\"128\" y=\"64\" font-size=\"8\">20 sec ago</text>\n  <text x=\"178\" y=\"64\" font-size=\"8\">30 sec ago</text>\n</svg>\n\n<p>Now let&#39;s say that we don&#39;t have this data all at once, but it is coming in to our React app at 10 second intervals. So when the app receives its first data point at time zero, we have one item in our array of data (<code>4.5</code>). After 10 seconds, we get another data point, <code>52</code>. Now we have a path, which we can start animating onto the graph. In another 10 seconds, we get in <code>37</code>, add another section to our path, and continue animating the path onto the graph.</p>\n<p>We are now going to go over the set-up for this. It is going to look slightly different from the previous post, but the ideas are all the same!</p>\n<pre><code>// let&#39;s make a container/component for our line graph\nimport React, { Component } from &#39;react&#39;;\n// we aren&#39;t going to go over the redux set-up at all,\n// but to make this work with real data we would probably\n// want to have redux handling the incoming data for us\nimport { connect } from &#39;react-redux&#39;;\n// and we&#39;ll use TweenMax for the animation part\nimport TweenMax from &#39;gsap/src/minified/TweenMax.min&#39;;\n\n// one helper function will be used for transforming\n// data into paths as the data comes in\nconst transformData = (data, xCoord) =&gt; {\n  let x = xCoord;\n  return data.reduce((path, point, index, collection) =&gt; {\n    if (!index) {\n      path += `${x} ${100 - point}`;\n    } else {\n      path += `C ${x + 5} ${100 - collection[index - 1]} ${x + 5} ${100 - point} ${x} ${100 - point}`;\n    }\n    x -= 10;\n    return path;\n  }, &#39;M&#39;);\n};\n\nclass LineGraph extends Component {\n  // we need to have a few things in the component state,\n  // so let&#39;s use a constructor function\n  constructor(props) {\n    super(props);\n    this.state = {\n      dataPath: &#39;&#39;,\n    };\n  }\n\n  componentWillReceiveProps(props) {\n    // props.data is the array of points\n    this.setState({\n      dataPath: transformData(props.data, -10),\n    });\n  }\n\n  render() {\n    return (\n      &lt;svg width=&quot;100%&quot; height=&quot;400&quot; viewBox=&quot;0 0 40 100&quot; preserveAspectRatio=&quot;none&quot;&gt;\n        &lt;g id=&quot;line_container&quot;&gt;\n          &lt;path stroke=&quot;#000&quot; fill=&quot;none&quot; d={this.state.dataPath} /&gt;\n        &lt;/g&gt;\n      &lt;/svg&gt;\n    );\n  }\n}</code></pre>\n<p>What we have now is a path that can grow indefinitely to the left. The last thing that is missing is the movement of the line onto and across the graph. We can add a Greensock <code>TweenMax</code> call to <code>componentWillReceiveProps</code> to cause this motion. If we animate <code>#line_container</code> rather than the path itself, we can later add additional paths to the container and only animate one node instead of many. If it is safe to assume we are receiving new props not more than once every 10 seconds, a 10 second duration for the animation should give a relatively smooth sequence as the path is added to. We are going to animate only when we receive new properties and have additional path to show. Note that we are passing <code>-10</code> as a starting x-coordinate to <code>transformData</code> when setting the state in <code>componentWillReceiveProps</code>. This means that the paths will be starting off the graph, and we won&#39;t start to see the lines animating onto the graph until the next, incoming section has been built.</p>\n<p>To add in the animation so that we can actually see the path as it grows:</p>\n<pre><code>// everything up here is the same. TweenMax has\n// already been included.\n\n// helper function is the same\n\nclass LineGraph extends Component {\n  // constructor is unchanged\n\n  componentWillReceiveProps(props) {\n    // props.data is the array of points\n    this.setState({\n      dataPath: transformData(props.data, -10),\n    });\n    // every time we get new props and additional path\n    // to render, we will animate the line container to the \n    // right (x: &#39;+=10&#39;) for 10 seconds, with linear easing\n    TweenMax.to(&#39;#line_container&#39;, 10, { x: &#39;+=10&#39;, ease: Power0.easeNone });\n  }\n\n  render() {\n    return (\n      &lt;svg width=&quot;100%&quot; height=&quot;400&quot; viewBox=&quot;0 0 40 100&quot; preserveAspectRatio=&quot;none&quot;&gt;\n        &lt;g id=&quot;line_container&quot;&gt;\n          &lt;path stroke=&quot;#000&quot; fill=&quot;none&quot; d={this.state.dataPath} /&gt;\n        &lt;/g&gt;\n      &lt;/svg&gt;\n    );\n  }\n}</code></pre>\n<p>So what we end up with is a <code>LineGraph</code> component that takes an array of data as a property. Subsequent arrays that get passed have new data points added to the end of the array. The component builds a new path from the array every time this property updates. The path will always start at <code>x = -10</code> for the first point in the array (which happens to be the oldest data point). Additional data points will build onto the path to the left. As the additional properties are received every 10 seconds, the container that holds the data path will be animated to the right, so that new sections of the path are animated onto the graph as they are assembled.</p>","meta":{"year":"2016","month":"05","day":"21","filename":"animated-svg-line-graphs","title":"Animated SVG/React Line Graphs","date":"2016-05-21T12:00:00.000Z","desc":"Putting things together for an animated line graph with React and SVG","tags":["SVG","data","React","GreenSock"]}}