{"content":"<p>Postgres offers a number of <a href=\"http://www.postgresql.org/docs/9.4/static/datatype-geometric.html\">geometric data types</a>, making for simple spatial queries on your data. It is tempting to use these native geometric data types when storing geographic information. Points in geographic space are typically mapped as latitude and longitude, which are, after all, just y and x coordinates, right? The problem is that in geometric terms, x and y are Cartesian coordinates &mdash; that is, they are mapped on a flat surface. Latitude and longitude are angular coordinates that map to a curved surface. </p>\n<p>This difference may not seem like a big deal, but it becomes very important when thinking about spatial relations. If you are on a Cartesian plane and want to move 1 unit in the <code>x</code> direction, your <code>y</code> coordinate doesn&#39;t matter. You could be at <code>y = 0</code> or <code>y = -89</code> or <code>y = 532</code>. One unit of <code>x</code> will be the same distance at all of those points. Now imagine you are standing at the equator. You want to travel one degree of longitude from where you currently are. One degree of longitude at the equator is about 111 km, so you head off. Later that week, you are standing one meter from the North Pole. You decide to travel one degree of longitude from your current position when you realize you only need to move about 1.7 cm to get there.</p>\n<p>Now imagine you are wanting to store points in a database. You want to be able to query for all points within 50 km of a given location. If the world were flat, Postgres geometric data types would be perfect for querying this geographic information. Since it is round, we can use the awesome PostGIS extension to get the results that we want.</p>\n<p>If you are on a Mac and are using <a href=\"http://postgresapp.com/\">Postgres.app</a>, you likely already have the PostGIS extension installed. Otherwise, download and installation instructions can be found on the <a href=\"http://postgis.net/\">PostGIS site</a>. Once we have Postgres up and running and PostGIS installed, we need to create a database and add the extension to this db instance.</p>\n<pre><code>$ createdb mySpatialDB\n$ psql mySpatialDB</code></pre>\n<p>Which opens up the command line interface for Postgres and specifies that we want to work with the <code>mySpatialDB</code> database. To add the PostGIS extension:</p>\n<pre><code>mySpatialDB=# CREATE EXTENSION postgis;</code></pre>\n<p>If all goes as planned, you should see <code>CREATE EXTENSION</code> pop up underneath this command. Great, now we are up and running with PostGIS! Time to create some tables, add some data, and start spatially querying!</p>","meta":{"year":"2016","month":"04","day":"19","filename":"why-postgis","title":"Why PostGIS?","date":"2016-04-19T12:00:00.000Z","desc":"Why PostGIS and how do I start?","tags":["Postgres","PostGIS","geographic data"]}}