{"content":"<p>I am currently working on a React/Redux project where we are trying to visualize a stream of incoming data. Our team kicked around some ideas about how to render the data into a graph with multiple lines. The main goals we had in mind were: </p>\n<ol>\n<li>Having some flexibility in formatting and styling our display, </li>\n<li>Interpolating between subsequent data points as they come in, and </li>\n<li>Animating the display to make the data stream appear continuous.</li>\n</ol>\n<p>We tried a handful of D3, React/D3, and React-based pre-existing solutions, but couldn&#39;t quite find what we were looking for. Ultimately I decided to try to write my own solution. Thanks to React&#39;s inherent rendering abilities, it wasn&#39;t nearly as difficult as I&#39;d expected.</p>\n<p>Our data source is coming in as objects, with a data point at each key. As a new object comes in, we add the data points to a data-tracking object that stores the data for each key as an array. Once an array reaches a certain length, we&#39;ll knock the oldest value off when a new value comes in. As an example:</p>\n<pre><code>// let&#39;s say we are measuring the decibel level\n// of various neighborhood noises every minute.\n// every minute we get an object that looks like this:\n{ dogs: 12, cats: 4, lawnmowers: 34, cars: 16 }\n\n// we also have an object that stores all of our\n// incoming data points in arrays for each data source:\n{ dogs: [], cats: [], lawnmowers: [], cars: [] }\n\n// when new data comes in, we put the incoming data into\n// our arrays. so after that first data object came in,\n// our storage would look like:\n{ dogs: [12], cats: [4], lawnmowers: [34], cars: [16] }\n\n// subsequent data points get added to the end of each\n// array. so if we got in some new data:\nvar newData = { dogs: 6, cats: 8, lawnmowers: 2, cars: 41 }\nvar storage = { dogs: [12, 6], cats: [4, 8], lawnmowers: [34, 2], cars: [16, 41] }\n\n// the last part here is that if the arrays grow beyond\n// a certain point, we will start to cull the oldest\n// values</code></pre>\n<p>Now that we have the format of our data out of the way, let&#39;s look at how we can go about actually rendering it for display. We want to have a line graph, with one line per data source (dogs, cats, lawnmowers, and cars). Each line will be rendered as an svg <code>path</code>. Time will be on the x axis, and decibels will be on the y axis. We hopefully won&#39;t be going anywhere above 100 decibels in our neighborhood, so let&#39;s just assume that the scale on our y axis can be 0 to 100.</p>\n<p>We know our x units are time, and we also know that we are getting a new data point every minute. So we can safely say that even x-axis intervals will separate our data points in a given path. We will be drawing these paths on an svg. Because svg coordinates start at the top left, we need to do a small transformation on our data to map it properly to our svg space. If our data is getting shown on a y-axis scale of 0 - 100 (and assuming we are certain that no values will be over 100), we can just subtract each value from 100. For instance, 16 becomes 84. This is because our graph will have its zero at the bottom... to go 16 units from the bottom of the graph, we need to move 84 units down from the top of the svg. </p>\n<p>So if we start with this array: [4.5, 52, 37, 91], we could convert it to [95.5, 48, 63, 9] to give us units we can use to render a path. Let&#39;s make a path out of the data! Again, time intervals between points are equal, so we&#39;ll move the same number of units of x for each point. For simplicity, let&#39;s go 50 units per point:</p>\n<pre><code>&lt;!-- again, our data looks like: [95.5, 48, 63, 9] --&gt;\n&lt;svg width=&quot;150&quot; height=&quot;100&quot; viewBox=&quot;0 0 150 100&quot;&gt;\n  &lt;path stroke=&quot;#000&quot; stroke-width=&quot;1&quot; fill=&quot;none&quot;\n    d=&quot;M 0 95.5 L 50 48 L 100 63 L 150 9&quot;\n  /&gt;\n&lt;/svg&gt;</code></pre>\n<p>Now we have a path that goes from (0, 95.5) to (50, 48) to (100, 63) to (150, 9). To actually build this path in React, we could do something like:</p>\n<pre><code>var path = arr.reduceRight((result, point, i, coll) =&gt; {\n  if (i === coll.length - 1) {\n    result.path += `${result.x} ${point}`;\n  } else {\n    result.path += `L ${result.x} ${point}`;\n  }\n  result.x += 50;\n  return result;\n}, { path: &#39;M&#39;, x: 0 });</code></pre>\n<p>In the next two installments, we&#39;ll go over how to interpolate between data points, then finally how to bring it all together and animate the line graph as new data comes in.</p>","meta":{"year":"2016","month":"05","day":"10","filename":"react-svg-graphs","title":"React SVG Graphs","date":"2016-05-10T12:00:00.000Z","desc":"Turning a stream of data into an SVG graph in React","tags":["React","SVG","data"]}}