{"content":"<p><a href=\"http://socket.io/\">Socket.IO</a> is a WebSocket API built for Node.js. For a while I&#39;d been intimidated by the idea of diving into WebSockets, but after looking over the documentation for Socket.IO I decided it was time to dive in. I was really surprised by how painless it was to get sockets up and running.</p>\n<p>To get started, <code>npm install --save socket.io</code> into your project, require it in your server and include <code>&lt;script src=&quot;/socket.io/socket.io.js&quot;&gt;&lt;/script&gt;</code> in your client index.html file. Checking out the <a href=\"http://socket.io/docs/\">Socket.IO docs</a> is probably the best way to start. On the server, Socket.IO listens for a &#39;connection&#39; event initiated when a client establishes a socket connection. From the Socket.IO docs example:</p>\n<pre><code>io.on(&#39;connection&#39;, function (socket) {\n  socket.emit(&#39;news&#39;, { hello: &#39;world&#39; });\n});</code></pre>\n<p>Once a connection is established, the callback function can send out (<code>emit</code>) messages to all connected clients. Likewise, within this callback is where you can also set up listeners for other event types, including custom event types of your choosing that you can set-up on the client. For instance:</p>\n<pre><code>io.on(&#39;connection&#39;, function (socket) {\n  // whenever a client connects, a news message gets emitted out \n  // to all connected clients\n  socket.emit(&#39;news&#39;, { hello: &#39;world&#39; });\n\n  // the socket listen for any incoming news\n  socket.on(&#39;myNews&#39;, function (newsReport) {\n    // when new news comes in, it gets emitted out to all \n    // connected clients\n    socket.emit( &#39;news&#39;, newsReport );\n  });\n});</code></pre>\n<p>On the client, we can grab a reference to the global <code>io</code> variable, then handle sending and receiving news reports:</p>\n<pre><code>var socket = io();\nvar newsReport = { hello: &#39;universe&#39; };\n\n// we listen for news coming in on the client, and when it does we \n// log the incoming message to the console the first \n// report.hello message we get will console out &#39;world&#39;\nsocket.on(&#39;news&#39;, function(report) {\n  console.log( report.hello );\n});\n\n// we send out our own news report using &#39;myNews&#39;. this message \n// will be received by the server and immediately sent back \n// to us thanks to the listener for &#39;myNews&#39; on the server. \n// we should see &#39;universe&#39; logged to the console.\nsocket.emit( &#39;myNews&#39;, newsReport );</code></pre>\n<p>I haven&#39;t gotten too deep into the Socket.IO API, but one thing that I came to realize pretty quickly was that I wanted to be able to identify clients, both on the server and in messages emitted from one client and received by others. The <code>socket</code> argument passed to the callback on <code>&#39;connection&#39;</code> has a unique ID applied on a per client/per session basis. By accessing this <code>.id</code> property, we can keep track of the clients that are connected to a session at a given time. There is likely a better way to do this, but I also ended up sending the client id back to the client so that it could be affixed to all subsequent emitted messages. This gave me an easy way to identify unique user messages on a given client. So, on the server:</p>\n<pre><code>// make an array to store the current client list on the server\nvar allClients = [];\n\nio.on(&#39;connection&#39;, function (socket) {\n  // grab the id property of the new connection and add it to the list \n  // of connected clients\n  allClients.push(socket.id);\n\n  // send the id back to the client\n  socket.send(socket.id);\n\n  // when the client disconnects, remove the corresponding id from \n  // the allClients array\n  socket.on(&#39;disconnect&#39;, function () {\n    allClients = allClients.filter(function (id) {\n      return id !== socket.id;\n    });\n  });\n});</code></pre>\n<p>Then on the client:</p>\n<pre><code>var socket = io(), clientId;\n\n// this corresponds to the &#39;socket.send(socket.id)&#39; line in the\n// server code. the id is the incoming message supplied to the \n// callback here\nsocket.on(&#39;message&#39;, function (message) {\n  clientId = message;\n});\n\n/****\n** now the clientId can be affixed to outgoing messages so\n** that the origin of incoming messages can be easily identified \n****/</code></pre>","meta":{"year":"2016","month":"03","day":"21","filename":"socket-to-me","title":"Socket To Me","date":"2016-03-21T12:00:00.000Z","desc":"The first things I learned when using Socket.IO","tags":["JavaScript","Socket.IO","NodeJS"]}}