{"content":"<p>The text wipe animation is a familiar means of introducing text to a frame, or, alternatively, removing text before transitioning the next bit of copy into a frame. Typically the text position remains static while it is apparently wiped away from one direction or another. So how to go about achieving a clean wipe?</p>\n<p>When going for a wipe effect, I had until recently focused on one techique. I&#39;ll call this the &quot;hidden overflow container&quot; technique. Basically, the text is held in a container with hidden overflow. When you are ready to wipe, the container gets translated in one direction, while the text gets translated in an equal and opposite direction.</p>\n<p>This technique gives you a wipe with a very clean boundary, which may be precisely what you&#39;re looking for. However, if the purpose of your wipe is merely to have an elegant means of transitioning text without just using a simple fade or a fly-off, then this other technique may be for you. I&#39;ll call this the &quot;character wrap&quot; technique. In this case, individual characters are identified in the markup so that they can be animated off the page one at a time, giving the appearance of a subtler wipe effect.</p>\n<p>Both of these techniques have their advantages and disadvantages, but the bottom line is that they don&#39;t look the same. In the first case, the control of the animation and how it looks happens at the scale of the block of copy, whereas in the latter case it is at the scale of the character.</p>\n<p>See below for some examples on how these look and work. All but the first example use the amazing <a href=\"https://greensock.com/\">Greensock animation library</a>.</p>\n<h2 id=\"wiping-with-an-overflow-hidden-container\">Wiping with an <code>overflow: hidden</code> container</h2>\n<p>Again, the idea here is to have your text in a container with <code>overflow: hidden</code>. To show or hide the text, translate the text into or out of the container while translating the container an equal distance in the opposite direction. The text should appear to remain still on the page while being &#39;wiped&#39; away.</p>\n<p>If you remove the <code>overflow</code> property on your wipe container, the wipe text should be positioned exactly where you want it to appear in the frame. You can more easily visualize the relative positions of the wipe container and the wipe text by removing the <code>overflow</code> property on the container and giving it a <code>background-color</code>.</p>\n<p>In the demo below, the first animation container has its <code>overflow</code> property set to <code>hidden</code>. That is the only difference between this and the second animation container, which has <code>overflow</code> set to <code>visible</code>. The third container has <code>overflow: hidden</code> with no bg colors on the text or the container. This is the &#39;wipe&#39; effect we&#39;re going for!</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"LGqwqY\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/LGqwqY/'>Wipe Visualization</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"angled-edge-wiping\">Angled edge wiping</h4>\n<p>What if we want the leading edge of the wipe to be set at an angle? Applying a skew to the container gives the container edge an angle. We need to remember to give the text a commensurate skew in the opposite direction in order for the text to appear unskewed.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"rxqKpw\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/rxqKpw/'>Angled Wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"wipe-on-wipe-off\">Wipe on, Wipe off</h4>\n<p>We can wipe onto a frame just as easily as we can wipe off. Just be aware that the starting position of your wipe container should be offset in the direction from which you want your wipe to occur. In the below example, the container for the text getting wiped off the screen has a green background to make it a little more clear what is going on.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"dGgaEa\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/dGgaEa/'>Wiping on, wiping off</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"bidirectional-wipe\">Bidirectional wipe</h4>\n<p>Getting fancier, we could wipe in two directions. This is surprisingly more difficult than you might expect at first. The idea is to have two wipe containers with the same text in each, with half of the text being shown in one container and half in the other. The containers need to be absolutely positioned so they can move around each other without affecting each other&#39;s positioning. An outer container is needed for each wipe so that the wiping of the text container doesn&#39;t actually reveal the remaining text that is positioned outside of the text container (remove <code>overflow: hidden</code> on the <code>.wipe-outer</code> element to see what I mean).</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"ZQqRve\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/ZQqRve/'>Bi-directional wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"multidirectional-wipe-aka-the-tv-set-power-down\">Multidirectional wipe, AKA the TV set power-down</h4>\n<p>How about a wipe coming in from all sides, like the way TV screens used to look when turn you turned one off? One way to do this would be to make a set-up like above for the last demo, but for 4 containers instead of 2. That sounds like a lot of work and a lot of room for errors. An easier &mdash; though not perfect &mdash; alternative is to do opposing zooms on the container and the text. If you want to zoom your container down to <code>scale: 0.1</code>, you&#39;d want your text to get zoomed to the inverse of 0.1 (1 / 0.1 = 10). Now, the endpoint scales are opposite each other. The reason this technique doesn&#39;t work perfectly is that the scales for the text and the container won&#39;t be each other&#39;s inverses at every point during the tween. To compensate for this, you can play around with the easing for the respective tweens to try to get them to more closely correspond to an inverse relationship. There is probably a formula you could use to figure out the correct tweens to use, but I&#39;m not that invested in figuring this out!</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"gPBKvJ\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/gPBKvJ/'>4-sided wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h2 id=\"wiping-via-character-wrapping\">Wiping via character wrapping</h2>\n<p>If we want to move the animation from the text container scale to the character scale, we need to wrap each individual character so that we can target it in the animation. Rather than actually going through and wrapping each character in a <code>&lt;span&gt;</code> tag manually, I added some jQuery to wrap the characters we want when the page loads. This could just as easily be done with vanilla javascript. Or, if you&#39;re a masochist, it could be done by wrapping each character by hand.</p>\n<h4 id=\"wiping-with-opacity\">Wiping with opacity</h4>\n<p>The <code>staggerTo</code>, <code>staggerFrom</code>, and <code>staggerFromTo</code> functions in the Greensock library are your friends when doing a series of the same animations on a bunch of elements that need to be slightly offset in your animation timeline. Animating a bunch of characters to achieve a &#39;wipe&#39; effect is a perfect use case for these functions. Below, I&#39;ve used <code>staggerTo</code> to fade each character in order.</p>\n<p>With the list of &#39;stagger&#39; functions, what you want to pay attention to if you&#39;re trying for a certain kind of wipe effect are the second and fourth parameters you pass in (second and fifth parameters in the case of <code>staggerFromTo</code>). The former of these is the duration of your animation, the latter is the offset time before the next element in your list will begin its animation. Try playing around with these values in the below demos to see how they work. </p>\n<p>Below is a wipe done by fading out each character individually. It makes the wipe look sort of like it has a blurred edge.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"OMdKYg\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/OMdKYg/'>Character Fade Wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"falling-down-not-the-michael-douglas-movie-\">Falling Down (not the Michael Douglas movie)</h4>\n<p>The next demo drops each character down in a series by scaling it down, then fading it out once it is scaled very small.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"WrPVWM\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/WrPVWM/'>Character Fall Wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"90-degree-turn-wipe\">90 degree turn wipe</h4>\n<p>Another example of an animation you can do at the character level to get your text off the screen.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"OMaXJP\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/OMaXJP/'>Character Rotate Wipe</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<h4 id=\"multiline-wipe-mdash-faking-an-angled-wipe\">Multiline wipe &mdash; faking an angled wipe</h4>\n<p>To me, where this method starts to look especially slick is where you have your text on multiple lines. You can make what looks like an angled wipe on your multi-line copy by carefully considering your duration and offset parameters. Generally, having a higher animation duration and a shorter timing offset seem to give more of an &#39;angled wipe&#39; appearance.</p>\n<p><p data-height=\"268\" data-theme-id=\"0\" data-slug-hash=\"rxPXgP\" data-default-tab=\"result\" data-user=\"benjanes\" class='codepen'>See the Pen <a href='http://codepen.io/benjanes/pen/rxPXgP/'>Multi-line Character Wipe (faking an angled wipe)</a> by Ben Janes (<a href='http://codepen.io/benjanes'>@benjanes</a>) on <a href='http://codepen.io'>CodePen</a>.</p></p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n\n<p>Alternatively, you could wrap each line, then wrap each character within a line. If you stagger when the character animations happen for each line, you could easily get a nice, angled look for your wipe.</p>\n<h2 id=\"further-considerations\">Further Considerations</h2>\n<p>In the character wrapping method, you may encounter situations where you want to do this animation but can&#39;t actually serve up the font you want to use in your animation (this happens all the time when developing banner ads). You could go about cutting out .png&#39;s of all of your characters, or spriting them into your animation container. If you have the font on hand, though, you could also make an SVG of the font, place it inline in your animation container, and animate the paths for each character you want to target. If characters are in more than one <code>&lt;path&gt;</code> element, group them together with a <code>&lt;g&gt;</code>. This isn&#39;t as accessible as text (or SVG text), but sometimes it is the best you can do!</p>","meta":{"year":"2016","month":"02","day":"14","filename":"how-do-you-wipe","title":"How do you wipe?","date":"2016-02-14T12:00:00.000Z","desc":"Text wipe transition animation techniques at the copy block or character level.","tags":["Greensock","animation","CSS","JavaScript","wipe transition"]}}