[{"title":"ImgWheel","desc":"A jQuery plugin for displaying rotating lists of images or other content","ghLink":"https://www.github.com/benjanes/imgwheel","mainLink":"http://www.benjanes.com/ImgWheel/"},{"title":"Science Leadership App","desc":"A Node.js/Angular app that simplifies contacting your state senators by outputting a PDF with a letter addressed to each of your senators' addresses. Senator contact info and placeholder letter copy curated and maintained by the Science Leadership Group.","mainLink":"http://app.scileadership.com/"},{"title":"WordCloud","desc":"A Backbone app that converts an uploaded text file to a word cloud image where word size is relative to its relative frequency in the document","ghLink":"https://github.com/benjanes/WordCloud","mainLink":"http://www.benjanes.com/WordCloud/"},{"title":"Slick.js Tabs","desc":"A demo syncing the sliding of a container's paginated tabs with the currently displayed tab in the container, using Slick slider","cpLink":"http://codepen.io/benjanes/pen/wBXRPZ"},{"title":"ES6 Tetris","desc":"Tetris clone for the browser.","ghLink":"https://github.com/benjanes/canvas-tetris"},{"title":"PaddlePals","desc":"Collaborative paddle ball game for up to 4 players with Node.js/Socket.io/D3","ghLink":"https://github.com/benjanes/paddle-pals","mainLink":"http://paddle-pals.herokuapp.com/"},{"title":"Sailboats","desc":"An exercise in hand-coded inline SVG animation vs. hand-coded canvas animation with requestAnimationFrame. I think the SMIL used in the SVG may now be deprecated in some browsers...","cpLink":"http://codepen.io/collection/ngYbog/"},{"title":"Chatson","desc":"Live sentiment analysis of Twitch chat channel language. This project died when the Watson API's sentiment analysis went from beta/free-tier to pay-based. Oh well. Source code available on github, though. Built with React/Node.js/Socket.io/RethinkDB/Watson API.","ghLink":"https://github.com/badT/Chatson"},{"title":"Professional Work","desc":"Drop me a line if you'd like examples of professional projects that I've worked on!","email":"brjanes@gmail.com"}]